pandas 는 고수준의 자료 구조와 파이썬을 통한 빠르고 쉬운 데이터 분석 도구를 포함한다.

특징
* 범용성
* 유연성 & 간결성
* 시계열&비시계열 통합 자료구조

pandas import 컨벤션

In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

## 5.1. pandas 자료 구조 소개

### 5.1.1. Series

Series 란?<br/>일련의 객체를 담을 수 있는 1차원 배열 같은 자료 구조

In [2]:
obj = Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a']

-5

In [10]:
obj2['d'] = 6

In [11]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [12]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [13]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [14]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [18]:
obj3 = Series(sdata)

In [19]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [20]:
states = ['Califonia', 'Ohio', 'Oregon', 'Texas']

In [21]:
obj4 = Series(sdata, index = states)

In [22]:
obj4

Califonia        NaN
Ohio         35000.0
Oregon       16000.0
Texas        71000.0
dtype: float64

In [23]:
pd.isnull(obj4)

Califonia     True
Ohio         False
Oregon       False
Texas        False
dtype: bool

In [24]:
pd.notnull(obj4)

Califonia    False
Ohio          True
Oregon        True
Texas         True
dtype: bool

In [25]:
obj4.isnull()

Califonia     True
Ohio         False
Oregon       False
Texas        False
dtype: bool

In [26]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [27]:
obj4

Califonia        NaN
Ohio         35000.0
Oregon       16000.0
Texas        71000.0
dtype: float64

In [28]:
obj3 + obj4

Califonia         NaN
Ohio          70000.0
Oregon        32000.0
Texas        142000.0
Utah              NaN
dtype: float64

In [29]:
obj4.name = 'population'

In [30]:
obj4.index.name = 'state'

In [31]:
obj4

state
Califonia        NaN
Ohio         35000.0
Oregon       16000.0
Texas        71000.0
Name: population, dtype: float64

In [32]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [33]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### 5.1.2. DataFrame

DataFrame 은 표 같은 스프레드시트 형식의 자료 구조이다.
* 각 컬럼은 서로 다른 종류의 데이터(숫자, 문자열, 불리언 등) 를 담을 수 있다.
* 로우와 컬럼에 대한 색인이 존재한다.
* Series 객체를 담고 있는 파이썬의 Dictionary 로 생각할 수 있다.
* 내부적으로 2차원 형식으로 데이터를 저장

DataFrame 객체 생성방법

* 같은 길이의 리스트에 담긴 사전을 이용
* NumPy 배열을 이용

In [4]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [5]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [6]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [7]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])

In [8]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [9]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [10]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [11]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [12]:
frame2['debt'] = 16.5

In [13]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [14]:
frame2['debt'] = np.arange(5.)

In [15]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

리스트나 배열을 컬럼에 대입할 때는 대입하려는 값의 길이가 DataFrame 의 크기와 같아야 한다

In [17]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [18]:
frame2['debt'] = val

In [19]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

존재하지 않는 컬럼에 데이터를 대입하면 컬럼이 생성된다.<br/>
파이썬 사전형에서와 마찬가지로 del 을 이용하여 컬럼을 삭제할 수 있다.

In [20]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [21]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'eastern'], dtype='object')

In [22]:
pop = {'Nevada': {2001:2.4, 2002:2.9},
      'Ohio': {2000:1.5, 2001:1.7, 2002:3.6}}

In [23]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [25]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [26]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [27]:
pdata = {'Ohio' : frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

In [28]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [29]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

In [30]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [31]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [32]:
frame2.values

array([[2000, 'Ohio', 1.5, nan, True],
       [2001, 'Ohio', 1.7, -1.2, True],
       [2002, 'Ohio', 3.6, nan, True],
       [2001, 'Nevada', 2.4, -1.5, False],
       [2002, 'Nevada', 2.9, -1.7, False]], dtype=object)

DataFrame 생성자에서 사용 가능한 입력 데이터

<table align="left">
    <thead>
        <td>형</td>
        <td>설명</td>
    </thead>
    <tbody>
        <tr>
            <td>2차원 ndarray</td>
            <td>데이터를 담고 잇는 행렬, 선택적으로 로우와 컬럼의 이름을 전달할 수 있다.</td>
        </tr>
        <tr>
            <td>배열, 리스트, 튜플의 사전</td>
            <td>사전의 모든 항목은 같은 길이를 가져야 하며, 각 항목의 내용이 DataFrame 의 컬럼이 된다.</td>
        </tr>
        <tr>
            <td>NumPy의 구조화 배열</td>
            <td>배열의 사전과 같은 방식으로 취급된다.</td>
        </tr>
        <tr>
            <td>Series 사전</td>
            <td>Series의 각 값이 컬럼이 된다. 명시적으로 색인을 넘겨주지 않으면 Series의 색인이 하나로 합쳐져서 로우의 색인이 된다.</td>
        </tr>
        <tr>
            <td>사전의 사전</td>
            <td>내부에 있는 사전이 컬럼이 된다. 키 값은 'Series의 사전'과 마찬가지로 합쳐져 로우의 색인이 된다.</td>
        </tr>
        <tr>
            <td>사전이나 Series의 리스트</td>
            <td>리스트의 각 항목이 DataFrame의 로우가 된다. 합쳐진 사전의 키값이나 Series의 색인이 DataFrame 컬럼의 이름이 된다.</td>
        </tr>
        <tr>
            <td>리스트나 튜플의 리스트</td>
            <td>'2차원 ndarray'와 같은 방식으로 취급된다.</td>
        </tr>
        <tr>
            <td>다른 DataFrame</td>
            <td>색인이 따로 지정되지 않는다면 DataFrame의 색인이 그대로 사용된다.</td>
        </tr>
        <tr>
            <td>NumPy MaskedArray</td>
            <td>'2차원 ndarray'와 같은 방식으로 취급되지만 마스크 값은 반환되는 DataFrame에서 NA 값이 된다.</td>
        </tr>
    </tbody>
</table>

### 5.1.3. 색인 객체

pandas 의 색인 객체는 표 형식의 데이터에서 각 로우와 컬럼에 대한 이름과 다른 메타데이터(축의 이름 등)를 저장하는 객체이다.<br/>
Series 나 DataFrame 객체를 생성할 때 사용되는 배열이나 혹은 다른 순차적인 이름은 내부적으로 색인으로 변환된다.

In [33]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [34]:
index = obj.index

In [35]:
index

Index(['a', 'b', 'c'], dtype='object')

In [36]:
index[1:]

Index(['b', 'c'], dtype='object')

색인은 변경 불가. 그래서 자료 구조 사이에서 안전하게 공유될 수 있다.

In [37]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [38]:
index = pd.Index(np.arange(3))

In [39]:
obj2 = Series([1.5, -2.5, 0], index=index)

In [40]:
obj2.index is index

True

pandas 의 주요 Index 객체

<table align="left">
    <thead>
        <td>클래스</td>
        <td>설명</td>
    </thead>
    <tbody>
        <tr>
            <td>Index</td>
            <td>가장 일반적인 Index 객체이며, 파있너 객체의 NumPy 배열 형식으로 축의 이름을 표현한다</td>
        </tr>
        <tr>
            <td>Int64Index</td>
            <td>정수 값을 위한 특수한 Index</td>
        </tr>
        <tr>
            <td>MultiIndex</td>
            <td>단일 축에 여러 단계의 색인을 표현하는 계층적 색인 객체, 튜플의 배열과 유사하다고 볼 수 있다.</td>
        </tr>
        <tr>
            <td>DatetimeIndex</td>
            <td>나노초 타임스탬프를 저장한다(NumPy 의 datatiem64 dtype 으로 표현한다)</td>
        </tr>
        <tr>
            <td>PeriodIndex</td>
            <td>기간 데이터를 위한 특수한 Index</td>
        </tr>
    </tbody>
</table>

In [41]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [42]:
'Ohio' in frame3.columns

True

In [43]:
2003 in frame3.index

False

색인 메서드와 속성

<table align="left">
    <thead>
        <td>메서드</td>
        <td>설명</td>
    </thead>
    <tbody>
        <tr>
            <td>append</td>
            <td>추가적인 Index 객체를 덧붙여 새로운 색인을 반환한다.</td>
        </tr>
        <tr>
            <td>diff</td>
            <td>색인의 차집합을 반환한다.</td>
        </tr>
        <tr>
            <td>intersection</td>
            <td>색인의 교집합을 반환한다.</td>
        </tr>
        <tr>
            <td>union</td>
            <td>색인의 합집합을 반환한다.</td>
        </tr>
        <tr>
            <td>isin</td>
            <td>넘겨받은 값이 해당 색인 위치에 존재하는지 알려주는 불리언 배열을 반환한다.</td>
        </tr>
        <tr>
            <td>delete</td>
            <td>i 위치의 색인이 삭제된 새로운 색인을 반환한다.</td>
        </tr>
        <tr>
            <td>drop</td>
            <td>넘겨받은 값이 삭제된 새로운 색인을 반환한다.</td>
        </tr>
        <tr>
            <td>insert</td>
            <td>i 위치에 값이 추가된 새로운 색인을 반환한다.</td>
        </tr>
        <tr>
            <td>is_monotonic</td>
            <td>색인이 단조성을 가진다면 True를 반한환다.</td>
        </tr>
        <tr>
            <td>is_unique</td>
            <td>중복되는 색인이 없다면 True를 반환한다.</td>
        </tr>
        <tr>
            <td>unique</td>
            <td>색인에서 중복되는 요소를 제거하고 유일한 값만을 반환한다.</td>
        </tr>
    </tbody>
</table>

* 단조성 - 진행방향이 항상 일정한 성질
    * 단조증가 - 항상 증가
    * 단조감소 - 항상 감소

## 5.2. 핵심기능

### 5.2.1. 재색인

In [46]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [47]:
obj2 = obj.reindex(['a', 'b', 'c' , 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [48]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [49]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [50]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

reindex 메서드(보간) 옵션

<table align="left">
    <thead>
        <td>인자</td>
        <td>설명</td>
    </thead>
    <tbody>
        <tr>
            <td>ffill 또는 pad</td>
            <td>앞의 값으로 채워 넣는다.</td>
        </tr>
        <tr>
            <td>bfill 또는 backfill</td>
            <td>뒤의 값으로 채워 넣는다.</td>
        </tr>
    </tbody>
</table>

In [51]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [53]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [54]:
states = ['Texas', 'Utah', 'California']

In [55]:
frame.reindex(columns=states)
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [57]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill', columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [58]:
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

재색인 함수 인자

<table align="left">
    <thead>
        <td>인자</td>
        <td>설명</td>
    </thead>
    <tbody>
        <tr>
            <td>index</td>
            <td>색인으로 사용할 새로운 순서, Index 인스턴스나 다른 순차적인 자료 구조를 사용할 수 있다.<br/>색인은 복사가 이루어지지 않고 그대로 사용</td>
        </tr>
        <tr>
            <td>method</td>
            <td>보간 메서드</td>
        </tr>
        <tr>
            <td>fill_value</td>
            <td>재색인 과정 중에 새롭게 나타나는 비어있는 데이터를 채우기 위한 값</td>
        </tr>
        <tr>
            <td>limit</td>
            <td>전/후 보간 시 사용하는 최대 갭 크기</td>
        </tr>
        <tr>
            <td>level</td>
            <td>MultiIndex 단계(level)에 단순 색인을 맞춘다. 그렇지 않으면 MultiIndex의 하위 부분집합에 맞춘다.</td>
        </tr>
        <tr>
            <td>copy</td>
            <td>True인 경우 새로운 색인이 이전 색인과 같더라도 데이터를 복사한다. False라면 두 색인이 같을 경우 데이터를 복사하지 않는다.</td>
        </tr>
    </tbody>
</table>

### 5.2.2. 하나의 로우 또는 컬럼 삭제하기

In [61]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [62]:
new_obj = obj.drop('c')

In [63]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [65]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [67]:
data = DataFrame(np.arange(16).reshape((4,4)), 
                 index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                 columns=['one', 'two', 'three', 'four'])

In [68]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [70]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [71]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### 5.2.3. 색인하기, 선택하기, 거르기

In [72]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [73]:
obj['b']

1.0

In [75]:
obj[1]

1.0

In [76]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [77]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [78]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [79]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

라벨 이름으로 슬라이싱 하는 것은 시작점과 끝점을 포함한다는 점이 일반 파이썬에서의 슬라이싱과 다른 점이다.

In [80]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [83]:
obj['b':'c'] = 5

In [84]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [85]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                index=['Ohio', 'Colorado', 'Utah', 'New York'],
                columns=['one', 'two', 'three', 'four'])

In [86]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [87]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [88]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [89]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [90]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [92]:
data[data < 5] = 0

In [93]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [94]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [95]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [96]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [97]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [98]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

DataFrame의 값 선택하기

<table align="left">
    <thead>
        <td>방식</td>
        <td>설명</td>
    </thead>
    <tbody>
        <tr>
            <td>obj[val]</td>
            <td>DataFrame에서 하나의 컬럼 또는 여러 컬럼을 선택한다. 편의를 위해서 불리언 배열, 슬라이스, 불리언 DataFrame 을 사용할 수 있다.</td>
        </tr>
        <tr>
            <td>obj.ix[val]</td>
            <td>DataFrame에서 로우의 부분집합을 선택한다.</td>
        </tr>
        <tr>
            <td>obj.ix[:, val]</td>
            <td>DataFrame에서 컬럼의 부분집합을 선택한다.</td>
        </tr>
        <tr>
            <td>obj.ix[val1, val2]</td>
            <td>DataFrame에서 로우와 컬럼의 부분집합을 선택한다.</td>
        </tr>
        <tr>
            <td>reindex 메서드</td>
            <td>하나 이상의 축을 새로운 색인으로 맞춘다.</td>
        </tr>
        <tr>
            <td>xs 메서드</td>
            <td>라벨 이름으로 단일 로우나 컬럼을 Series 형식으로 선택한다.</td>
        </tr>
        <tr>
            <td>icol, irow 메서드</td>
            <td>각각 정수 색인으로 단일 로우나 컬럼을 Series 형식으로 선택한다.</td>
        </tr>
        <tr>
            <td>get_value, set_value 메서드</td>
            <td>로우와 컬럼 으림으로 DataFrame 값을 선택한다.</td>
        </tr>
    </tbody>
</table>

### 5.2.4 산술연산과 데이터 정렬

In [100]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [101]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [102]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [103]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [104]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [107]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), 
               columns=list('bcd'),
               index=['Ohio', 'Texas', 'Colorado'])

In [109]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), 
               columns=list('bde'),
               index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [110]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [111]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [112]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [113]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

In [114]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [115]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [116]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [117]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [118]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [119]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

산술연산 메서드

<table align="left">
    <thead>
        <td>메서드</td>
        <td>설명</td>
    </thead>
    <tbody>
        <tr>
            <td>add</td>
            <td>덧셈(+)을 위한 메서드</td>
        </tr>
        <tr>
            <td>sub</td>
            <td>뺄셈(-)을 위한 메서드</td>
        </tr>
        <tr>
            <td>div</td>
            <td>나눗셈(/)을 위한 메서드</td>
        </tr>
        <tr>
            <td>mul</td>
            <td>곱셈(*)을 위한 메서드</td>
        </tr>
    </tbody>
</table>

DataFrame 과 Series 간의 연산

In [120]:
arr = np.arange(12.).reshape((3, 4))

In [121]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [122]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [123]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

DataFrame 과 Series 의 연산은 브로드캐스트(broadcasting) 에 대한 예제이다.<br/>벡터연산을 쉽게 할 수 있도록 하기 위해 pandas 가 갖고 있는 특징 중 하나이다.

In [124]:
frame = DataFrame(np.arange(12.).reshape((4, 3)),
                 columns=list('bde'),
                 index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [125]:
series = frame.ix[0]

In [126]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [127]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [128]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [130]:
frame.sub(series)

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [131]:
series2 = Series(range(3), index=['b', 'e' , 'f'])

In [133]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [134]:
series3 = frame['d']

In [135]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [136]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [137]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### 5.2.5. 함수 적용과 매핑

pandas 객체에도 NumPy 유니버셜 함수(배열의 각 원소에 적용되는 메서드)를 적용할 수 있다.

In [140]:
frame = DataFrame(np.random.randn(4, 3),
                 columns=list('bde'),
                 index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [141]:
frame

               b         d         e
Utah   -1.884544  0.129619  0.420007
Ohio    1.268450  1.043249 -1.180035
Texas   0.229025 -2.055630  0.742132
Oregon -0.311410 -0.241654 -1.740452

In [142]:
np.abs(frame)

               b         d         e
Utah    1.884544  0.129619  0.420007
Ohio    1.268450  1.043249  1.180035
Texas   0.229025  2.055630  0.742132
Oregon  0.311410  0.241654  1.740452

In [143]:
f = lambda x : x.max() - x.min()

In [144]:
frame.apply(f)

b    3.152994
d    3.098879
e    2.482584
dtype: float64

In [145]:
frame.apply(f, axis=1)

Utah      2.304551
Ohio      2.448484
Texas     2.797762
Oregon    1.498799
dtype: float64

In [146]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [147]:
frame.apply(f)

            b         d         e
min -1.884544 -2.055630 -1.740452
max  1.268450  1.043249  0.742132

In [148]:
format = lambda x: '%.2f' % x

In [149]:
frame.applymap(format)

            b      d      e
Utah    -1.88   0.13   0.42
Ohio     1.27   1.04  -1.18
Texas    0.23  -2.06   0.74
Oregon  -0.31  -0.24  -1.74

In [150]:
frame['e'].map(format)

Utah       0.42
Ohio      -1.18
Texas      0.74
Oregon    -1.74
Name: e, dtype: object

### 5.2.6 정렬과 순위

In [151]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [153]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [154]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a' ,'b', 'c'])

In [155]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [156]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [157]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [158]:
obj = Series([4, 7, -3, 2])

In [159]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [160]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

NAN 값은 정렬(sort_values) 시 제일 마지막에 위치한다.

In [163]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [162]:
obj.sort_values(ascending=False)

2    7.0
0    4.0
5    2.0
4   -3.0
1    NaN
3    NaN
dtype: float64

In [164]:
frame = DataFrame({'b':[4, 7, -3, 2], 'a':[0, 1, 0, 1]})

In [165]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [166]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [167]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

순위는 정렬과 거의 흡사하면, 1부터 배열의 유효한 데이터 개수까지의 순위를 매긴다.<br/>또한 numpy.argsort 에서 반환하는 간접 정렬 색인과 유사하나, 동률인 순위를 처리하는 방식이 다르다.

In [168]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

rank() 의 경우 동률이 발생할 경우 평균 순위를 매긴다

In [169]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

데이터 상에서 나타나는 순서에 따라 순위를 매길 수도 있다.

In [170]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

내림차순으로 순위를 매길 수도 있다.

In [171]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [172]:
frame = DataFrame({'b':[4.3, 7, -3, 2], 'a':[0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [173]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [174]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

순위의 동률을 처리하는 메서드

<table align="left">
    <thead>
        <td>메서드</td>
        <td>설명</td>
    </thead>
    <tbody>
        <tr>
            <td>average</td>
            <td>기본값 : 같은 값을 가지는 항목의 평균 값을 순위로 삼는다.</td>
        </tr>
        <tr>
            <td>min</td>
            <td>같은 값을 가지는 그룹을 낮은 순위로 매긴다.</td>
        </tr>
        <tr>
            <td>max</td>
            <td>같은 값을 가지는 그룹을 높은 순위로 매긴다.</td>
        </tr>
        <tr>
            <td>first</td>
            <td>데이터 내에서 위치에 따라 순위를 매긴다.</td>
        </tr>
    </tbody>
</table>

### 5.2.7. 중복 색인

Pandas 의 대부분의 함수에서 색인값은 유일해야 하나, 강제사항은 아니다.

In [3]:
obj = Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])

In [4]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [6]:
obj.index.is_unique

False

In [7]:
obj['a']

a    0
a    1
dtype: int64

In [8]:
obj['c']

4

In [9]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [10]:
df

          0         1         2
a -0.908008 -0.962928 -1.624215
a  0.328072 -0.911570  1.899179
b  0.031330 -0.507834  0.098116
b  1.328039  0.562100 -0.585498

## 5.3. 기술통계 계산과 요약

In [13]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
              index=['a', 'b', 'c' ,'d'],
              columns=['one', 'two'])

In [14]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [15]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [16]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [17]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

축소 메서드 옵션

<table align="left">
    <thead>
        <td>옵션</td>
        <td>설명</td>
    </thead>
    <tbody>
        <tr>
            <td>axis</td>
            <td>연산을 수행할 축, DataFrame 에서 0은 row이고 1은 column이다.</td>
        </tr>
        <tr>
            <td>skipna</td>
            <td>누락된 값을 제외할 것인지 정하는 옵션, 기본값은 은 True</td>
        </tr>
        <tr>
            <td>level</td>
            <td>계산하려는 축이 계층적 색인이라면 레벨에 따라 묶어서 계산한다.</td>
        </tr>
    </tbody>
</table>

In [18]:
df.idxmax()

one    b
two    d
dtype: object

In [19]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

요약통계를 한 번에 계산할 수도 있다.

In [20]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

수치 데이터가 아니라면 다른 요약통계를 생성한다.

In [21]:
obj = Series(['a', 'a', 'b', 'c']*4)

In [23]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [24]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

기술 통계와 요약 통계

<table align="left">
    <thead>
        <td>메서드</td>
        <td>설명</td>
    </thead>
    <tbody>
        <tr>
            <td>count</td>
            <td>NA 값을 제외한 값의 수를 반환</td>
        </tr>
        <tr>
            <td>describe</td>
            <td>Series 나 DataFrame 의 각 컬럼에 대한 요약통계를 계산</td>
        </tr>
        <tr>
            <td>min, max</td>
            <td>최소, 최대값 계산</td>
        </tr>
        <tr>
            <td>argmin, argmax</td>
            <td>각각 최소, 최대 값을 갖고 있는 색인의 위치를 반화나</td>
        </tr>
        <tr>
            <td>idxmin, idxmax</td>
            <td>각각 최소, 최대 값을 갖고 있는 색인의 값을 반환</td>
        </tr>
        <tr>
            <td>qunatile</td>
            <td>0부터 1까지 분위수를 계산</td>
        </tr>
        <tr>
            <td>sum</td>
            <td>합을 계산</td>
        </tr>
        <tr>
            <td>mean</td>
            <td>평균을 계산</td>
        </tr>
        <tr>
            <td>median</td>
            <td>중간 값(50% 분위)를 반환</td>
        </tr>
        <tr>
            <td>mad</td>
            <td>평균 값에서 절대 평균편차를 계산</td>
        </tr>
        <tr>
            <td>var</td>
            <td>표본 분산 계산</td>
        </tr>
        <tr>
            <td>std</td>
            <td>표본 정규 분산값을 계산</td>
        </tr>
        <tr>
            <td>skew</td>
            <td>표본 비대칭도(3차 적률)의 값을 계산</td>
        </tr>
        <tr>
            <td>kurt</td>
            <td>표본 첨도(4차 적률)의 값을 계산</td>
        </tr>
        <tr>
            <td>cumsum</td>
            <td>누적 합 계산</td>
        </tr>
        <tr>
            <td>cummin, cummax</td>
            <td>각각 누적 최소 값과 누적 최대 값을 계삿ㄴ</td>
        </tr>
        <tr>
            <td>cumprod</td>
            <td>누적 곱 계산</td>
        </tr>
        <tr>
            <td>diff</td>
            <td>1차 산술 차를 계산(시계열 데이터 처리시 유용)</td>
        </tr>
        <tr>
            <td>pct_change</td>
            <td>퍼센트 변화율 계산</td>
        </tr>
    </tbody>
</table>

### 5.3.1. 상관관계와 공분산

* 상관관계
* 공분산

In [3]:
import pandas.io.data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)
    
price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

In [4]:
returns = price.pct_change()

In [6]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-06-15 -0.003283  0.000905 -0.002516 -0.002810
2016-06-16  0.004221 -0.011907  0.002522  0.014087
2016-06-17 -0.022758 -0.026240  0.006157 -0.005160
2016-06-20 -0.002413  0.002877  0.010659 -0.001197
2016-06-21  0.008517  0.003215  0.002864  0.022369

* corr - NA가 아니고 정렬된 색인에서 연속되는 두 Series 에 대해 상관관계를 계산
    * method
        * pearson(피어슨 상관계수) - 기본값
        * kendall(켄달 상관계수)
        * spearman(스피어만 상관계수)
* cov - 공분산 계산

In [7]:
returns.MSFT.corr(returns.IBM)

0.49517885088374963

In [8]:
returns.MSFT.cov(returns.IBM)

8.9057797139095087e-05

DataFrame 전체에 대해서 상관관계, 공분산을 한번에 계산할 수 있습니다.

In [9]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.406909  0.386919  0.393928
GOOG  0.406909  1.000000  0.401512  0.463502
IBM   0.386919  0.401512  1.000000  0.495179
MSFT  0.393928  0.463502  0.495179  1.000000

In [10]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000283  0.000110  0.000079  0.000098
GOOG  0.000110  0.000259  0.000079  0.000110
IBM   0.000079  0.000079  0.000148  0.000089
MSFT  0.000098  0.000110  0.000089  0.000219

특정 Series 에 대해서 DataFrame 전에 항목과 상관관계, 공분산을 계산할 수 있습니다.

In [12]:
returns.corrwith(returns.IBM)

AAPL    0.386919
GOOG    0.401512
IBM     1.000000
MSFT    0.495179
dtype: float64

In [13]:
returns.corrwith(volume)

AAPL   -0.078245
GOOG   -0.003844
IBM    -0.202947
MSFT   -0.094115
dtype: float64

### 5.3.2. 유일 값, 값 세기, 멤버쉽

In [14]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b' , 'b', 'c', 'c'])

In [15]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [17]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [18]:
pd.value_counts(obj.values, sort=False)

a    3
b    2
d    1
c    3
dtype: int64

In [19]:
mask = obj.isin(['b', 'c'])

In [20]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [21]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

유일 값, 값 세기, 버리기 메서드

<table align="left">
    <thead>
        <td>메서드</td>
        <td>설명</td>
    </thead>
    <tbody>
        <tr>
            <td>isin</td>
            <td>Series의 각 원소가 넘겨받은 연속된 값에 속하는지를 나타내는 Boolean 배열을 반환</td>
        </tr>
        <tr>
            <td>unique</td>
            <td>Series에서 중복되는 값을 제거하고 유일한 값만 포함되는 배열을 반환. 정렬하지 않음</td>
        </tr>
        <tr>
            <td>value_counts</td>
            <td>Series에서 유일 값에 대한 색인 값과 도수를 계산, 결과는 도수 값의 내림차순으로 정렬</td>
        </tr>
    </tbody>
</table>

In [22]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                 'Qu2': [2, 3, 1, 2, 3],
                 'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [23]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 5.4. 누락된 데이터 처리하기

pandas 의 모든 기술통계는 누락된 데이터를 배제하고 처리합니다.<br/>
누락된 데이터는 타임에 상관없이 NaN(Not a Number) 로 처리합니다.

In [24]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [25]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

Python 의 None 값도 NaN으로 취급합니다.

In [26]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

NA 처리 메서드

<table align="left">
    <thead>
        <td>인자</td>
        <td>설명</td>
    </thead>
    <tbody>
        <tr>
            <td>dropna</td>
            <td>누락된 데이터가 있는 축(row, column)을 제외. 어느 정도의 누락 데이터까지 용인할 것인지 지정 가능</td>
        </tr>
        <tr>
            <td>fillna</td>
            <td>누락된 데이터를 대신할 값을 채우거나, ffill or bfill 같은 보간 메서드를 적용</td>
        </tr>
        <tr>
            <td>isnull</td>
            <td>누락되거나 NaN 인 값을 알려주는 불리언 값을 반환</td>
        </tr>
        <tr>
            <td>notnull</td>
            <td>isnull 과 반대</td>
        </tr>
    </tbody>
</table>

### 5.4.1. 누락된 데이터 골라내기

In [27]:
from numpy import nan as NA

In [28]:
data = Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [29]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [31]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [32]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                 [NA, NA, NA], [NA, 6.5, 3.]])

In [33]:
cleaned = data.dropna()

In [36]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [37]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [38]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [39]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [40]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [41]:
df = DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.033913 -0.397392 -0.476713
1 -0.808412  0.314752 -0.907274
2 -2.512147 -0.658863 -1.084677
3  0.129353  0.704741 -0.703823
4  1.472483  2.311152  0.505109
5  0.211762  0.744736  1.142994
6  1.211555 -0.845568 -1.600418

In [42]:
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA

In [43]:
df

          0         1         2
0  0.033913       NaN       NaN
1 -0.808412       NaN       NaN
2 -2.512147       NaN       NaN
3  0.129353       NaN -0.703823
4  1.472483       NaN  0.505109
5  0.211762  0.744736  1.142994
6  1.211555 -0.845568 -1.600418

몇 개 이상의 값이 들어있는 로우만 살펴보고 싶다면 thres 인자를 사용하면 됩니다.

In [44]:
df.dropna(thresh=3)

          0         1         2
5  0.211762  0.744736  1.142994
6  1.211555 -0.845568 -1.600418

### 5.4.2. 누락된 값 채우기

In [45]:
df.fillna(0)

          0         1         2
0  0.033913  0.000000  0.000000
1 -0.808412  0.000000  0.000000
2 -2.512147  0.000000  0.000000
3  0.129353  0.000000 -0.703823
4  1.472483  0.000000  0.505109
5  0.211762  0.744736  1.142994
6  1.211555 -0.845568 -1.600418

In [46]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.033913  0.500000       NaN
1 -0.808412  0.500000       NaN
2 -2.512147  0.500000       NaN
3  0.129353  0.500000 -0.703823
4  1.472483  0.500000  0.505109
5  0.211762  0.744736  1.142994
6  1.211555 -0.845568 -1.600418

In [47]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  0.033913  0.000000  0.000000
1 -0.808412  0.000000  0.000000
2 -2.512147  0.000000  0.000000
3  0.129353  0.000000 -0.703823
4  1.472483  0.000000  0.505109
5  0.211762  0.744736  1.142994
6  1.211555 -0.845568 -1.600418

In [48]:
df = DataFrame(np.random.randn(6, 3))

In [49]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA

In [50]:
df

          0         1         2
0 -0.832516  0.910756  1.190776
1  1.395643 -1.427172  2.036678
2  1.653389       NaN -0.073012
3 -0.921110       NaN -1.699237
4  0.219118       NaN       NaN
5 -1.708296       NaN       NaN

In [51]:
df.fillna(method='ffill')

          0         1         2
0 -0.832516  0.910756  1.190776
1  1.395643 -1.427172  2.036678
2  1.653389 -1.427172 -0.073012
3 -0.921110 -1.427172 -1.699237
4  0.219118 -1.427172 -1.699237
5 -1.708296 -1.427172 -1.699237

In [52]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.832516  0.910756  1.190776
1  1.395643 -1.427172  2.036678
2  1.653389 -1.427172 -0.073012
3 -0.921110 -1.427172 -1.699237
4  0.219118       NaN -1.699237
5 -1.708296       NaN -1.699237

In [53]:
data = Series([1., NA, 3.5, NA, 7])

In [54]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

fillna 함수 인자

<table align="left">
    <thead>
        <td>인자</td>
        <td>설명</td>
    </thead>
    <tbody>
        <tr>
            <td>value</td>
            <td>비어있는 값을 채울 스칼라 값이나 사전 형식의 객체</td>
        </tr>
        <tr>
            <td>method</td>
            <td>보간 방식, 기본적으로 ffill 사용</td>
        </tr>
        <tr>
            <td>axis</td>
            <td>값을 채워 넣을 축, 기본값은 0</td>
        </tr>
        <tr>
            <td>inplace</td>
            <td>복사본을 생성하지 않고 호출한 객체를 변경, 기본값은 False</td>
        </tr>
        <tr>
            <td>limit</td>
            <td>값을 앞 혹은 뒤에서부터 몇 개까지 채울지 지정</td>
        </tr>
    </tbody>
</table>

## 5.5. 계층적 색인

Pandas 는 축에 대해 다중 색인 단계를 지정할 수 있도록 해 줍니다.

In [57]:
data = Series(np.random.randn(10), index = [['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                                        [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.219899
   2    0.186423
   3   -0.015055
b  1   -1.052232
   2   -0.172747
   3    2.449226
c  1   -1.755547
   2   -1.346561
d  2    0.294257
   3    2.398674
dtype: float64

In [58]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [59]:
data['b']

1   -1.052232
2   -0.172747
3    2.449226
dtype: float64

In [60]:
data['b':'c']

b  1   -1.052232
   2   -0.172747
   3    2.449226
c  1   -1.755547
   2   -1.346561
dtype: float64

In [61]:
data.ix[['b', 'd']]

b  1   -1.052232
   2   -0.172747
   3    2.449226
d  2    0.294257
   3    2.398674
dtype: float64

In [63]:
data[:, 2]

a    0.186423
b   -0.172747
c   -1.346561
d    0.294257
dtype: float64

In [64]:
data.unstack()

          1         2         3
a  0.219899  0.186423 -0.015055
b -1.052232 -0.172747  2.449226
c -1.755547 -1.346561       NaN
d       NaN  0.294257  2.398674

In [65]:
data.unstack().stack()

a  1    0.219899
   2    0.186423
   3   -0.015055
b  1   -1.052232
   2   -0.172747
   3    2.449226
c  1   -1.755547
   2   -1.346561
d  2    0.294257
   3    2.398674
dtype: float64

In [67]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                 columns=[['Ohio', 'Ohio', 'Colorado',],
                         ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [81]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [82]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

MultiIndex 를 따로 생성한 다음 재사용도 가능합니다.

In [83]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                      names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

### 5.5.1. 계층 순서 바꾸고 정렬하기

swaplevel 은 넘겨받은 2개의 계층 번호나 이름이 뒤바뀐 새로운 객체를 반환합니다.

In [84]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

sortlevel 은 단일 계층에 속한 데이터를 정렬합니다.

In [85]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [86]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### 5.5.2. 단계별 요약통계

In [87]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [88]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### 5.5.3. DataFrame 컬럼 사용하기

In [93]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                  'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                  'd': [0, 1, 2, 0, 1, 2, 3]})

In [94]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [95]:
frame2 = frame.set_index(['c', 'd'])

In [96]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [97]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [98]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Pandas와 관련된 기타 주제

### 5.6.1. 정수 색인

In [99]:
ser = Series(np.arange(3.))

아래 코드가 오류가 발생합니다.<br/>
ser 은 0, 1, 2 색인을 갖고 있지만, -1이 위치 색인인지 이름 색인인지 알기 어렵기 때문입니다.

In [100]:
ser[-1]

KeyError: -1

In [101]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [102]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [103]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [106]:
ser3 = Series(range(3), index=[-5, 1, 3])

In [107]:
ser3.iloc[2]

2

In [108]:
frame = DataFrame(np.arange(6).reshape(3,2), index=[2, 0, 1])

In [109]:
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int64

### 5.6.2. Penal 데이터

Penal 은 DataFrame 의 3차원 버전이라 이해하면 쉽습니다.

In [115]:
import pandas.io.data as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk)) 
                      for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [116]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1648 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2016-06-21 00:00:00
Minor_axis axis: Open to Adj Close

In [117]:
pdata = pdata.swapaxes('items', 'minor')

In [118]:
pdata['Adj Close']

                  AAPL      DELL        GOOG       MSFT
Date
2010-01-04   28.141855  14.06528  313.062468  26.045432
2010-01-05   28.190509  14.38450  311.683844  26.053846
2010-01-06   27.742101  14.10397  303.826685  25.893956
2010-01-07   27.690818  14.23940  296.753749  25.624666
2010-01-08   27.874915  14.36516  300.709808  25.801387
2010-01-11   27.629014  14.37483  300.255255  25.473190
2010-01-12   27.314734  14.56830  294.945572  25.304883
2010-01-13   27.700023  14.57797  293.252243  25.540513
2010-01-14   27.539595  14.22005  294.630868  26.053846
2010-01-15   27.079353  13.92985  289.710772  25.969694
2010-01-19   28.277297  14.32646  293.516976  26.171662
2010-01-20   27.842040  14.03626  289.915587  25.742480
2010-01-21   27.360757  13.92017  291.199286  25.254391
2010-01-22   26.003700  13.18982  274.730736  24.370781
2010-01-25   26.703269  13.43650  269.730740  24.673733
2010-01-26   27.080668  13.13662  270.939526  24.825210
2010-01-27   27.335774  13.08825  270.779695  24.968270
2010-01-28   26.206206  12.84641  266.878565  24.539088
2010-01-29   25.255478  12.47882  264.705742  23.714387
2010-02-01   25.606576  12.78837  266.244198  23.907939
2010-02-02   25.755169  12.86576  265.295156  23.950015
2010-02-03   26.198316  12.92380  270.140309  24.093076
2010-02-04   25.254163  12.58523  263.127321  23.428266
2010-02-05   25.702570  12.80772  265.380075  23.579742
2010-02-08   25.526363  12.95282  266.468996  23.327281
2010-02-09   25.798564  13.10760  267.952522  23.571326
2010-02-10   25.657862  13.30107  266.958496  23.554495
2010-02-11   26.124677  13.49454  267.932539  23.663895
2010-02-12   26.349539  13.38813  266.294170  23.504004
2010-02-16   26.746662  13.67834  270.380071  23.969011
...                ...       ...         ...        ...
2016-05-10   93.419998       NaN  723.179993  50.665626
2016-05-11   92.510002       NaN  715.289978  50.695417
2016-05-12   90.339996       NaN  713.309998  51.152221
2016-05-13   90.519997       NaN  710.830017  50.725211
2016-05-16   93.879997       NaN  716.489990  51.470002
2016-05-17   93.489998       NaN  706.229980  50.509998
2016-05-18   94.559998       NaN  706.630005  50.810001
2016-05-19   94.199997       NaN  700.320007  50.320000
2016-05-20   95.220001       NaN  709.739990  50.619999
2016-05-23   96.430000       NaN  704.239990  50.029999
2016-05-24   97.900002       NaN  720.090027  51.590000
2016-05-25   99.620003       NaN  725.270020  52.119999
2016-05-26  100.410004       NaN  724.119995  51.889999
2016-05-27  100.349998       NaN  732.659973  52.320000
2016-05-31   99.860001       NaN  735.719971  53.000000
2016-06-01   98.459999       NaN  734.150024  52.849998
2016-06-02   97.720001       NaN  730.400024  52.480000
2016-06-03   97.919998       NaN  722.340027  51.790001
2016-06-06   98.629997       NaN  716.549988  52.130001
2016-06-07   99.029999       NaN  716.650024  52.099998
2016-06-08   98.940002       NaN  728.280029  52.040001
2016-06-09   99.650002       NaN  728.580017  51.619999
2016-06-10   98.830002       NaN  719.409973  51.480000
2016-06-13   97.339996       NaN  718.359985  50.139999
2016-06-14   97.459999       NaN  718.270020  49.830002
2016-06-15   97.139999       NaN  718.919983  49.689999
2016-06-16   97.550003       NaN  710.359985  50.389999
2016-06-17   95.330002       NaN  691.719971  50.130001
2016-06-20   95.099998       NaN  693.710022  50.070000
2016-06-21   95.910004       NaN  695.940002  51.189999

[1648 rows x 4 columns]

In [123]:
pdata.ix[:, '6/21/2016', :]

            Open        High        Low       Close      Volume   Adj Close
AAPL   94.940002   96.349998   94.68000   95.910004  35229500.0   95.910004
DELL         NaN         NaN        NaN         NaN         NaN         NaN
GOOG  698.400024  702.770020  692.01001  695.940002   1464300.0  695.940002
MSFT   50.200001   51.430000   50.16000   51.189999  33989400.0   51.189999

In [124]:
pdata.ix['Adj Close', '6/20/2016':, :]

                 AAPL  DELL        GOOG       MSFT
Date
2016-06-20  95.099998   NaN  693.710022  50.070000
2016-06-21  95.910004   NaN  695.940002  51.189999

In [125]:
stacked = pdata.ix[:, '6/20/2016':, :].to_frame()

In [126]:
stacked

                        Open        High         Low       Close      Volume  \
Date       minor
2016-06-20 AAPL    96.000000   96.570000   95.029999   95.099998  33942300.0
           GOOG   698.770020  702.479980  693.409973  693.710022   2071400.0
           MSFT    50.639999   50.830002   50.029999   50.070000  35559500.0
2016-06-21 AAPL    94.940002   96.349998   94.680000   95.910004  35229500.0
           GOOG   698.400024  702.770020  692.010010  695.940002   1464300.0
           MSFT    50.200001   51.430000   50.160000   51.189999  33989400.0

                   Adj Close
Date       minor
2016-06-20 AAPL    95.099998
           GOOG   693.710022
           MSFT    50.070000
2016-06-21 AAPL    95.910004
           GOOG   695.940002
           MSFT    51.189999

In [127]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 2 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2016-06-20 00:00:00 to 2016-06-21 00:00:00
Minor_axis axis: AAPL to MSFT